<a href="https://colab.research.google.com/github/SauravDakre/MachineLearning/blob/master/basics/python/pandaBasics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Panda
- Pandas is an open-source library that offers various data structures and operations for manipulating numerical data and time series
## core components of panda
  - **series** : is essentially a column
  - **dataframe**: is a multi-dimensional table made up of a collection of Series.

## Import pandas library

In [7]:
import pandas as pd

## creating dataframe

In [5]:
#  from dictionary
dict1={
    'name':('mra', 'mrb', "mrc"),
    'age': (19,20,21),
    'department':('it', 'fin', 'accounts')
}

df1 = pd.DataFrame(dict1)
df1

  name  age department
0  mra   19         it
1  mrb   20        fin
2  mrc   21   accounts

In [6]:
df2 = pd.DataFrame(dict1, index=['a','b','c'])
df2

  name  age department
a  mra   19         it
b  mrb   20        fin
c  mrc   21   accounts

## basic functionality

In [8]:
df2['age'] # fetch column

a    19
b    20
c    21
Name: age, dtype: int64

In [11]:
df2.loc['a'] # fetch row

name          mra
age            19
department     it
Name: a, dtype: object

In [12]:
df2.head(1)

  name  age department
a  mra   19         it

In [13]:
df2.tail(1)

  name  age department
c  mrc   21   accounts

In [15]:
df.shape

(3, 3)

In [16]:
df2.T # print transpose

              a    b         c
name        mra  mrb       mrc
age          19   20        21
department   it  fin  accounts

In [17]:
df2

  name  age department
a  mra   19         it
b  mrb   20        fin
c  mrc   21   accounts

In [18]:
df2.axes # gives row & column axis label

[Index(['a', 'b', 'c'], dtype='object'),
 Index(['name', 'age', 'department'], dtype='object')]

In [20]:
df2.dtypes # gives datatype of each column

name          object
age            int64
department    object
dtype: object

In [21]:
df2.empty

False

In [22]:
df2.ndim # Returns the number of dimensions of the object

2

In [23]:
df.size # Returns the number of elements in the DataFrame

9

In [24]:
df.values # Returns the actual data in the DataFrame as an NDarray.

array([['mra', 19, 'it'],
       ['mrb', 20, 'fin'],
       ['mrc', 21, 'accounts']], dtype=object)